# DisplacedElementDisplacementX Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DisplacedElementDisplacementX Property
ParameterTypeId Class See Also
---
"X Displacement"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DisplacedElementDisplacementX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DisplacedElementDisplacementX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DisplacedElementDisplacementX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace